function f = f3(x)
    x = x'%由于给的是个行向量，而我们下面的代码是按照列向量算的，所以需要转置
    p1 = 3;
    p2 = 1;
    k1 = 1;
    k2 = 3;
    a = [1.37 9.45 4.43 6.66 3.14 15.92];
    b = [10.21 9.45 8.88 5 16.44 18];
    x1 = 4; y1=1; x2=8; y2=9;
    tmp_x = x ./ (x + 1);                                   %坐标距离
    f = [repmat(p1, 1, 6),repmat(p2, 1, 6)]*x + (sqrt(sum(([a;b] - repmat([x1;y1], 1, 6))) .^ 2)  .* repmat(k1,1,6) * tmp_x([1:6],:) + sqrt(sum(([a;b] - repmat([x2;y2], 1, 6))) .^ 2)  .* repmat(k2,1,6)* tmp_x([7:12],:));

    sum(([a;b] - repmat([x1;y1], 1, 6))) .^ 2
end