

function [c,ceq] = nonlfun4(deleta_theta)
    x = [150 85 150 145 130  0]; % 初始位置的横坐标
    y = [140 85 155  50 150  0]; % 初始位置的纵坐标
    theta = [243 236 220.5 159 230 52] * pi / 180; % 初始的飞行方向角，注意转化为弧度制
    
    %%%%%%========注意绘图时要把速度改小一些才方便观察=========%%%%%%
    v = 800;  % 飞机速度 
    
    % 为了方便，先计算当前时刻调整后的角度值
    co = cos(theta + deleta_theta);
    si = sin(theta + deleta_theta);
    
    d = zeros(6); %用d(i,j)矩阵来记录任意两飞机之间的距离
    
    % 用两层for循环枚举，计算d(i,j)，只需要计算上三角即可
    for i = 1 : 5
        for j = i + 1 : 6
            % 计算我们推导出来的驻点
            fenzi = (x(i) - x(j))*(co(i) - co(j)) + (y(i) - y(j))*(si(i) - si(j));
            fenmu = v * ((co(i) - co(j)).^2 + (si(i) - si(j)).^2);
            t = -1*fenzi/fenmu;
            % 先检查一下驻点的意义
            if (t <= 0)
                d(i,j) = 1000; %此时说明两架飞机是渐行渐远的，一定安全，所以给一个较大的值，但不能给Inf，你可以试试会发生什么
            else
                % 此时驻点有意义，代入
                d(i,j) = ((x(i) + v*t*co(i)) - (x(j) + v*t*co(j))).^2 + ((y(i) + v*t*si(i)) - (y(j) + v*t*si(j))).^2;
            end
            
            %^得到非线性不等式约束，注意原来是>号，要换成<号
            c = repmat(64,15,1) - [d(1,2:6)';d(2,3:6)';d(3,4:6)';d(4,5:6)';d(5,6)'];
        end
    end
    ceq = []; %因为我们没有非线性等式约束，所以设为空
end
